FinTrac/app/controllers/friendships_controller.rb

SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = $1 AND "friendships"."friend_id" = $2 ORDER BY "friendships"."id" ASC LIMIT $3  [["user_id", 3], ["friend_id", 1], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 3]]
---
	def destroy
		@friendship = current_user.friendships.where(friend_id: params[:id]).first
		@friendship.destroy