FinTrac/app/controllers/users_controller.rb

	def search
		@users = User.search(params[:search_param])
---
SELECT "users".* FROM "users" WHERE (lower(last_name) like '%rajath%')

	def add_friend
		@friend = User.find(params[:friend])
		current_user.friendships.build(friend_id: @friend.id)

		if current_user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["friend_id", 1], ["created_at", 2017-03-25 07:12:03 UTC], ["updated_at", 2017-03-25 07:12:03 UTC]]