FinTrac/app/controllers/user_stocks_controller.rb

SELECT "user_stocks".* FROM "user_stocks"
---
  def index
    @user_stocks = UserStock.all

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 ORDER BY "stocks"."id" ASC LIMIT $2  [["ticker", "GOOG"], ["LIMIT", 1]]
INSERT INTO "stocks" ("ticker", "name", "last_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ticker", "GOOG"], ["name", "Alphabet Inc."], ["last_price", 0.8514e3], ["created_at", 2017-03-22 08:49:51 UTC], ["updated_at", 2017-03-22 08:49:51 UTC]]
---
  def create
    if params[:stock_id].present?
      @user_stock = UserStock.new(stock_id: params[:stock_id], user: current_user)
    else
      stock = Stock.find_by_ticker(params[:stock_ticker])
      if stock
        @user_stock = UserStock.new(user: current_user, stock: stock)
      else
        stock = Stock.new_from_lookup(params[:stock_ticker])
        if stock.save

DELETE FROM "user_stocks" WHERE "user_stocks"."id" = $1  [["id", 1]]
---
  def destroy
    @user_stock.destroy

SELECT  "user_stocks".* FROM "user_stocks" WHERE "user_stocks"."user_id" = $1 AND "user_stocks"."stock_id" = $2 ORDER BY "user_stocks"."id" ASC LIMIT $3  [["user_id", 1], ["stock_id", 3], ["LIMIT", 1]]
---
    def set_user_stock
      @user_stock = current_user.user_stocks.where(stock_id:params[:id]).first