PhotoApp/app/controllers/images_controller.rb

INSERT INTO "images" ("name", "picture", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["picture", "Screenshot_from_2017-03-24_05-06-32.png"], ["user_id", 28], ["created_at", 2017-03-31 07:33:30 UTC], ["updated_at", 2017-03-31 07:33:30 UTC]]
---
  def create
    @image = Image.new(image_params)
    @image.user = current_user
    if current_user.plan == "free" and current_user.images.count > 9
      flash[:error] = "Cannot upload more than 10 images for free account"
      render :new and return
    end

    respond_to do |format|
      if @image.save