PhotoApp/app/controllers/registrations_controller.rb

INSERT INTO "payments" ("email", "token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "aishwa@gmail.com"], ["token", "tok_1A3Ft6FBIzUI0YtiSTOV73Qx"], ["user_id", 28], ["created_at", 2017-03-31 02:53:21 UTC], ["updated_at", 2017-03-31 02:53:21 UTC]]
INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
  def create
    build_resource(sign_up_params)

    resource.class.transaction do
      resource.save
      yield resource if block_given?
      if resource.persisted?
        if params["user"][:plan].to_s == "paid"
          @payment = Payment.new({ email: params["user"]["email"],
          token: params[:payment]["token"], user_id: resource.id })

          flash[:error] = "Please check registration errors" unless @payment.valid?

          begin
            @payment.process_payment
            @payment.save
          rescue Exception => e
            flash[:error] = e.message

            resource.destroy